In [1]:
import pandas as pd

In [2]:
data = {
    'id': [2, 1, 1],
    'name': ['Vinay', 'Kushal', 'Aman'],
    'age': [22, 25, 24],
    'occ': ['engineer', 'doctor', 'accountant']
}
df = pd.DataFrame(data)
df

   id    name  age         occ
0   2   Vinay   22    engineer
1   1  Kushal   25      doctor
2   1    Aman   24  accountant

In [3]:
df['name']

0     Vinay
1    Kushal
2      Aman
Name: name, dtype: object